jetacpp/jetacpp-imxrt1010_wolfssl_fatfs/source/host_msd_fatfs.c
}

static void USB_Decrypt_Files(usb_host_msd_fatfs_instance_t *msdFatfsInstance)
{
	FRESULT fatfsCode;
	uint8_t drive[3];
	uint8_t path_in[32], path_out[32], name[32];
	DIR dir;

	sprintf((char *)&drive[0], "%c:", USBDISK + '0');
	fatfsCode = f_mount(&fatfs, (char const *)&drive[0], 0);
	if (fatfsCode)
	{
		return;
	}
	uint32_t start = g_ticks;
	size_t processed = 0;

	if ((fatfsCode = f_opendir(&dir, drive)) == 0)
	{
		FILINFO fileInfo;
		while (1)
		{
			char * ch;
			fatfsCode = f_readdir(&dir, &fileInfo);
			if (fatfsCode || !strlen(fileInfo.fname))
				break;
			strcpy(name, fileInfo.fname);

			if ((ch = strstr(name, ".ENC"))) {
				usb_echo( "Decrypting %s \r\n", name);
				sprintf(path_in, "%s/%s", drive, name);
				*ch = 0;
				sprintf(path_out, "%s/%s", drive, name);
				aes_decrypt_file(path_in, path_out);
	  			processed += fileInfo.fsize;
	  			// delete encrypted file
	  			f_unlink(path_in);
			}
		}
    	usb_echo("Decrypting speed: %d bytes/sec \r\n", (int)(processed/(g_ticks-start)));
	}
}

void USB_HostMsdTask(void *arg)
{
    usb_status_t status;
    usb_host_msd_fatfs_instance_t *msdFatfsInstance = (usb_host_msd_fatfs_instance_t *)arg;

    if (msdFatfsInstance->deviceState != msdFatfsInstance->prevDeviceState)
    {
        msdFatfsInstance->prevDeviceState = msdFatfsInstance->deviceState;
        switch (msdFatfsInstance->deviceState)
        {
            case kStatus_DEV_Idle:
                break;

            case kStatus_DEV_Attached: /* deivce is attached and numeration is done */
                status = USB_HostMsdInit(msdFatfsInstance->deviceHandle,
                                         &msdFatfsInstance->classHandle); /* msd class initialization */
                g_UsbFatfsClassHandle = msdFatfsInstance->classHandle;
                if (status != kStatus_USB_Success)
                {
                    usb_echo("usb host msd init fail\r\n");
                    return;
                }
                msdFatfsInstance->runState = kUSB_HostMsdRunSetInterface;
                break;

            case kStatus_DEV_Detached: /* device is detached */
                msdFatfsInstance->deviceState = kStatus_DEV_Idle;
                msdFatfsInstance->runState = kUSB_HostMsdRunIdle;
                USB_HostMsdDeinit(msdFatfsInstance->deviceHandle,
                                  msdFatfsInstance->classHandle); /* msd class de-initialization */
                msdFatfsInstance->classHandle = NULL;

                usb_echo("mass storage device detached\r\n");
                break;

            default:
                break;
        }
    }

    /* run state */
    switch (msdFatfsInstance->runState)
    {
        case kUSB_HostMsdRunIdle:
            break;

        case kUSB_HostMsdRunSetInterface: /* set msd interface */
            msdFatfsInstance->runState = kUSB_HostMsdRunIdle;
            msdFatfsInstance->runWaitState = kUSB_HostMsdRunWaitSetInterface;
            status = USB_HostMsdSetInterface(msdFatfsInstance->classHandle, msdFatfsInstance->interfaceHandle, 0,
                                             USB_HostMsdControlCallback, msdFatfsInstance);
            if (status != kStatus_USB_Success)
            {
                usb_echo("set interface fail\r\n");
            }
            break;

        case kUSB_HostMsdRunMassStorageTest: /* set interface succeed */
#if 0
#if ((defined MSD_FATFS_THROUGHPUT_TEST_ENABLE) && (MSD_FATFS_THROUGHPUT_TEST_ENABLE))
            USB_HostMsdFatfsThroughputTest(msdFatfsInstance); /* test throughput */
#else
            USB_HostMsdFatfsTest(msdFatfsInstance); /* test msd device */
#endif /* MSD_FATFS_THROUGHPUT_TEST_ENABLE */
#endif

            msdFatfsInstance->runState = kUSB_HostMsdRunIdle;
            break;

        case kUSB_HOSTMsdRunWaitEncDec:
        	USER_LED_OFF();
        	if (!msdFatfsInstance->aes_init) {
				aes_init();
				msdFatfsInstance->aes_init = 1;
        	}
        	if (g_user_action == ACTION_ENCRYPT){
                msdFatfsInstance->runState = kUSB_HostMsdRunEnc;
                msdFatfsInstance->runWaitState = kUSB_HOSTMsdRunWaitEncDec;
        	}
        	else if(g_user_action == ACTION_DECRYPT) {
                msdFatfsInstance->runState = kUSB_HostMsdRunDec;
                msdFatfsInstance->runWaitState = kUSB_HOSTMsdRunWaitEncDec;
        	}
        	break;

        case kUSB_HostMsdRunEnc:
        	USER_LED_ON();
        	USB_Encrypt_Files(msdFatfsInstance);
        	msdFatfsInstance->runState = kUSB_HOSTMsdRunWaitEncDec;
        	g_user_action = ACTION_NONE;
        	break;

        case kUSB_HostMsdRunDec:
        	USER_LED_ON();
        	USB_Decrypt_Files(msdFatfsInstance);
        	msdFatfsInstance->runState = kUSB_HOSTMsdRunWaitEncDec;
        	g_user_action = ACTION_NONE;

        default:
            break;
    }
}

usb_status_t USB_HostMsdEvent(usb_device_handle deviceHandle,
                              usb_host_configuration_handle configurationHandle,
                              uint32_t eventCode)
{
    usb_status_t status = kStatus_USB_Success;
    usb_host_configuration_t *configuration;
    uint8_t interfaceIndex;
    usb_host_interface_t *interface;
    uint32_t infoValue;
    uint8_t id;

    switch (eventCode)
    {
        case kUSB_HostEventAttach:
            /* judge whether is configurationHandle supported */
            configuration = (usb_host_configuration_t *)configurationHandle;
            for (interfaceIndex = 0; interfaceIndex < configuration->interfaceCount; ++interfaceIndex)
            {
                interface = &configuration->interfaceList[interfaceIndex];
                id = interface->interfaceDesc->bInterfaceClass;
                if (id != USB_HOST_MSD_CLASS_CODE)
                {
                    continue;
                }
                id = interface->interfaceDesc->bInterfaceSubClass;
                if ((id != USB_HOST_MSD_SUBCLASS_CODE_UFI) && (id != USB_HOST_MSD_SUBCLASS_CODE_SCSI))
                {
                    continue;
                }
                id = interface->interfaceDesc->bInterfaceProtocol;
                if (id != USB_HOST_MSD_PROTOCOL_BULK)
                {
                    continue;
                }
                else
                {
                    if (g_MsdFatfsInstance.deviceState == kStatus_DEV_Idle)
                    {
                        /* the interface is supported by the application */
                        g_MsdFatfsInstance.deviceHandle = deviceHandle;
                        g_MsdFatfsInstance.interfaceHandle = interface;
                        g_MsdFatfsInstance.configHandle = configurationHandle;
                        return kStatus_USB_Success;
                    }
                    else
                    {
                        continue;
                    }
                }
            }
            status = kStatus_USB_NotSupported;
            break;

        case kUSB_HostEventNotSupported:
            break;

        case kUSB_HostEventEnumerationDone:
            if (g_MsdFatfsInstance.configHandle == configurationHandle)
            {
                if ((g_MsdFatfsInstance.deviceHandle != NULL) && (g_MsdFatfsInstance.interfaceHandle != NULL))
                {
                    /* the device enumeration is done */
                    if (g_MsdFatfsInstance.deviceState == kStatus_DEV_Idle)
                    {
                        g_MsdFatfsInstance.deviceState = kStatus_DEV_Attached;

                        USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDevicePID, &infoValue);
                        usb_echo("mass storage device attached:pid=0x%x", infoValue);
                        USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDeviceVID, &infoValue);
                        usb_echo("vid=0x%x ", infoValue);
                        USB_HostHelperGetPeripheralInformation(deviceHandle, kUSB_HostGetDeviceAddress, &infoValue);
                        usb_echo("address=%d\r\n", infoValue);
                    }
                    else
                    {
                        usb_echo("not idle msd instance\r\n");
                        status = kStatus_USB_Error;
                    }
                }
            }
            break;

